#define _CRT_SECURE_NO_WARNINGS //免报错
#include <stdio.h>

int main01()
{
	    //全局变量的生命周期 ：整个程序的生命周期（main主函数的生命周期）
	{   //局部变量的生命周期 ：进它的作用域开始——出它的作用域结束
		int a = 10;
		printf("a = %d\n", a);//ok
	}
	//printf("a = %d\n", a);//error
	return 0;
}

//int main()
//{
//	//全局变量的作用域是整个工程
//	//为声明的标识符
//	//声明extern外部符号的
//	extern int g_val;
//	printf("g_val = %d\n", g_val);
//	return 0;
//}

//int global = 2020;
//
//void test()
//{
//	printf("test()-- %d\n", global);
//}
//
//int main()
//{
//	test();
//	printf("%d\n", global);
//    return 0;
//}

//int main()
//{
//	{
//		int num = 0; //局部变量的作用域为所在代码块{}
//		printf("num = %d\n", num);
//	}
//	//int num = 0;
//	return 0;
//}

//int main()
//{
	//计算两个数的和                       //int age = 20;//4个字节的空间   ——————————
//	int num1 = 0;                          //                               |                  |
//	int num2 = 0;                          //                               |------------------|
//	int sum = 0;                           //                               |                  |
	//输入数据-使用输入函数scanf           //                    108970 ->  |                  |
//   scanf("%d%d",&num1,&num2);//取地址&   //                     地址      |------------------|
	//C语言语法规定，变量要定义在{}中最前面//                               |                  |
	                                       //                               |                  |
//	sum = num1 + num2;                     //                               |                  |
//	printf("sum =%d\n",sum);               //                               |                  |
//	return 0;                              //                               |                  |
//}                                        //                               |                  |
                                           //                               |                  |
//int a = 10;                              //                               |                  |
//                                         //                               |                  |
//int main()                               //                               |                  |
//{                                        //                               |                  |
//	{                                      //                               |                  |
//		int a = 10;                        //                               |                  |
//	}                                      //                               |                  |
//	printf("%d\n", a);//为局部变量时 报错  //                               |                  |
//	return 0;                              //                               |                  |
//}                                        //                               |                  |
                                           //                               ——————————
//int a = 100;
//
//int main()
//{
//	//int a = 10;
//	//局部变量和全局变量的名字建议不要相同-容易误会，产生bug
//	//当局部变量和全局变量的名字相同的时候，局部变量优先
//	printf("%d\n", a);
//	return 0;
//}

//int num2 = 20;//全局变量 - 定义在代码块（{}）之外的变量
//
//int main()
//{
//	int num = 10;//局部变量 - 定义在{}之内的变量
//
//	return 0;
//}

//int main()
//{
//	//年龄
//	//20
//	short age = 20;//向内存申请2个字节 = 16bit位，用来存放20
//	float weight = 95.6f;//向内存申请4个字节，存放小数95.6
//}

//int main()
//{
//	printf("%d\n", sizeof(char)); //1个字节 8个比特位
//	printf("%d\n", sizeof(short)); //2 16
//	printf("%d\n", sizeof(int)); //4 32
//	printf("%d\n", sizeof(long));//4 32
//	printf("%d\n", sizeof(long long)); //8 64 
//	printf("%d\n", sizeof(float)); //4 32
//	printf("%d\n", sizeof(double));//8 64
//	return 0;
//
//	short int age = 20; // 2byte 16bit  （2^16-1 = 65535 个整型数字）
//}

//包含一个叫stdio.h的文件
//std-标准库 standard input output

//int 整型
//main 前面的int表示main函数调用返回一个整型值

//int main() //主函数 // 程序入口 只能有一个main函数
//{
//	printf("呵尼玛\n");
//	return 0; //返回 0
//}
//这种写法是过时的

//int main()
//{
//	//printf("函数 - function - printf - 打印函数");//屏幕输出 
//	////库函数-C语言本身提供给我们使用的函数
//	////#include
//	//return 0;
//
//	char ch = 'A'; //申请了一块内存空间叫 ch 存放‘A’这个字符 
//	printf("%c\n", ch); //%c -- 打印字符格式的数据
//	//20;
//	long num = 100;
//	printf("%d", num); //打印长整型
//	int age = 20;
//	printf("%d"); //%d -- 打印整型十进制数据
//	float f = 5.0;
//	printf("%f\n", f);
//	double d = 3.14;
//	printf("%lf\n", d);
//
//	return 0;
//}

//char - 字符类型
//%d - 打印整型
//%c - 打印字符
//%f - 打印浮点数字
//%p - 以地址的形式打印
//%x - 打印16进制数字
//%o ...

// char 字符类型
// 00000000
// ......   
// 11111111
//0~2^8 -1            //十进制

// short 短整型
// 00000000 00000000 
// ......           //二进制范围 
// 11111111 11111111
//0~2^16 -1

// int 整型
// 00000000 00000000 00000000 00000000
// .....
// 11111111 11111111 11111111 11111111
//0~2^32 -1

// long 长整型
// 00000000 00000000 00000000 00000000
// .....
// 11111111 11111111 11111111 11111111
//0~2^32 -1

// longlong 更长整型
// 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000
// ......
// 11111111 11111111 11111111 11111111 11111111 11111111 11111111 11111111
//0~2^64 -1

// float 单精度浮点型
// 00000000 00000000 00000000 00000000 
// ......
// 11111111 11111111 11111111 11111111
//0~2^32 -1

// double 双精度浮点型
// 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000
// ......
// 11111111 11111111 11111111 11111111 11111111 11111111 11111111 11111111
//0~2^64 -1 

// C语言有没有字符串类型？

//计算机中的单位                   //计算机是硬件 -- 通电 
//bit比特 只能存放 1 或 0             //正电  负电
//byte  一个字节=8个比特位            // 1   //0              //二进制
//kb   1024个byte                                             0 1
//mb   1024个kb                                               //十进制
//gb     .                                                   0 1 2 3 ...9
//tb     .
//pb     .

//C语言标准规定
//sizeof(long)>=sizeof(int) 
//       4或8           4
//       取决于平台       

//变量、常量
//生活中不变的量--常量

//定义变量的方法
//int age = 150;
//......

//变量的分类
//局部变量
//全局变量